> A<-matrix(c(2,0,1,3),ncol=2)
> B<-matrix(c(5,2,4,-1),ncol=2)
> C=A+B
> D=A+B
> C
     [,1] [,2]
[1,]    7    5
[2,]    2    2
> D
     [,1] [,2]
[1,]    7    5
[2,]    2    2
> diag(c(4,1,2,3))
     [,1] [,2] [,3] [,4]
[1,]    4    0    0    0
[2,]    0    1    0    0
[3,]    0    0    2    0
[4,]    0    0    0    3
> Matrix<-matrix(0,nrow=5,ncol=5)
> Matrix[1,]<-1
> Matrix[,1]<-2
> diag(Matrix)<-3
> print(Matrix)
     [,1] [,2] [,3] [,4] [,5]
[1,]    3    1    1    1    1
[2,]    2    3    0    0    0
[3,]    2    0    3    0    0
[4,]    2    0    0    3    0
[5,]    2    0    0    0    3
